ХамелионЦРПТ/src/Documents/АвтоКорректировкаОстатков_ХамелеонЦРПТ/АвтоКорректировкаОстатков_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АвтоКорректировкаОстатков_ХамелеонЦРПТ</name>
  <registerRecords>AccumulationRegister.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.Резервы_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cis</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>dataemission</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОстаткаПоследний</name>
    <type>
      <types>EnumRef.СпособВыпускаТоваров_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Страница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договора_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_Эмитировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_в_Обороте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_выбыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_ЭмитированоПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_в_ОборотеПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_выбылоПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв1С</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_строки_партии</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_Эмитировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_в_Обороте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_выбыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_ЭмитированоПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_в_ОборотеПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ_выбылоПрограммно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв1С</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФильтрПоGTIN</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМЭмитированые_ХамелеонЦРПТ/ОстаткиКМЭмитированые_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМЭмитированые_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КМОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/AccumulationRegisters/Резервы_ХамелеонЦРПТ/Резервы_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Резервы_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/InformationRegisters/СерийныеНомера_ХамелеонЦРПТ/СерийныеНомера_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СерийныеНомера_ХамелеонЦРПТ</name>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_строки_партии</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКороба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаллет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_Эмитировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_в_Обороте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_выбыло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_ЭмитированоПрограммно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_в_ОборотеПрограммно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКМ_выбылоПрограммно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Резерв1С</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументКорректировки</name>
    <type>
      <types>DocumentRef.АвтоКорректировкаОстатков_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>cis</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Documents/АвтоКорректировкаОстатков_ХамелеонЦРПТ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Очистить();
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Очистить();
	Движения.Резервы_ХамелеонЦРПТ.Записывать=Истина;
	Движения.Резервы_ХамелеонЦРПТ.Очистить();
	
	Если ЭтотОбъект.СерийныеНомера.Количество()>0 Тогда
		
		Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
			
			
			cis=Стр.cis;
			
			Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" 
				ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"  Тогда
				Если Сред(cis,1,4)="(01)" И Сред(cis,19,4)="(21)" Тогда
					cis=Сред(cis,2,2)+Сред(cis,5,14)+Сред(cis,20,2)+Сред(cis,23);
				Конецесли;
				
				
			Конецесли;
			
			
			Если Стр.Резерв<>Стр.Резерв1С Тогда
				Добав=Движения.Резервы_ХамелеонЦРПТ.Добавить();
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=Стр.Резерв-Стр.Резерв1С;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				 Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			
			Если Стр.КоличествоКМ_Эмитировано<>Стр.КоличествоКМ_ЭмитированоПрограммно Тогда
				//Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(cis) Тогда
					//Стр.cis=Стр.cis;
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=Стр.КоличествоКМ_Эмитировано-Стр.КоличествоКМ_ЭмитированоПрограммно;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(Стр.GTIN));
				Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			Если Стр.КоличествоКМ_в_Обороте<>Стр.КоличествоКМ_в_ОборотеПрограммно Тогда
				//Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(cis) Тогда
					//Стр.cis=Стр.cis;
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=Стр.КоличествоКМ_в_Обороте-Стр.КоличествоКМ_в_ОборотеПрограммно;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(Стр.GTIN));
				Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		
		
		
		
		
		
		
		
		
		
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера_ХамелеонЦРПТ.cis КАК cis,
		|	СерийныеНомера_ХамелеонЦРПТ.GTIN КАК GTIN,
		//|	СерийныеНомера_ХамелеонЦРПТ.Наим КАК GTIN,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_Эмитировано) КАК КоличествоКМ_Эмитировано,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_в_Обороте) КАК КоличествоКМ_в_Обороте,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_выбыло) КАК КоличествоКМ_выбыло,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_ЭмитированоПрограммно) КАК КоличествоКМ_ЭмитированоПрограммно,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_в_ОборотеПрограммно) КАК КоличествоКМ_в_ОборотеПрограммно,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.КоличествоКМ_выбылоПрограммно) КАК КоличествоКМ_выбылоПрограммно,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.Резерв) КАК Резерв,
		|	СУММА(СерийныеНомера_ХамелеонЦРПТ.Резерв1С) КАК Резерв1С
		|ИЗ
		|	РегистрСведений.СерийныеНомера_ХамелеонЦРПТ КАК СерийныеНомера_ХамелеонЦРПТ
		|ГДЕ
		|	СерийныеНомера_ХамелеонЦРПТ.ДокументКорректировки = &ДокументКорректировки
		|
		|СГРУППИРОВАТЬ ПО
		|	СерийныеНомера_ХамелеонЦРПТ.cis,
		|	СерийныеНомера_ХамелеонЦРПТ.GTIN
		|ИТОГИ
		|	СУММА(КоличествоКМ_Эмитировано),
		|	СУММА(КоличествоКМ_в_Обороте),
		|	СУММА(КоличествоКМ_выбыло),
		|	СУММА(КоличествоКМ_ЭмитированоПрограммно),
		|	СУММА(КоличествоКМ_в_ОборотеПрограммно),
		|	СУММА(КоличествоКМ_выбылоПрограммно),
		|	СУММА(Резерв),
		|	СУММА(Резерв1С)
		|ПО
		|	cis,
		|	GTIN";
	
	Запрос.УстановитьПараметр("ДокументКорректировки",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборкаcis = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборкаcis.Следующий() Цикл
		// Вставить обработку выборки Выборкаcis
	
		Стр= Выборкаcis.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока Стр.Следующий() Цикл
		cis=Стр.cis;
		Если ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" 
				ИЛИ ЭтотОбъект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак"  Тогда
				Если Сред(cis,1,4)="(01)" И Сред(cis,19,4)="(21)" Тогда
					cis=Сред(cis,2,2)+Сред(cis,5,14)+Сред(cis,20,2)+Сред(cis,23);
				Конецесли;
				
				
			Конецесли;
			
			
	
		//Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
			Если Стр.Резерв<>Стр.Резерв1С Тогда
				Добав=Движения.Резервы_ХамелеонЦРПТ.Добавить();
				Добав.ВидДвижения=ВидДвиженияНакопления.Расход;
				Добав.Количество=Стр.Резерв-Стр.Резерв1С;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				 Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			
			Если Стр.КоличествоКМ_Эмитировано<>Стр.КоличествоКМ_ЭмитированоПрограммно Тогда
				//Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(cis) Тогда
					//Стр.cis=cis;
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
//				Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=Стр.КоличествоКМ_Эмитировано-Стр.КоличествоКМ_ЭмитированоПрограммно;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Попытка
					Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(Стр.GTIN));
				Исключение
				КонецПопытки;
				Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			Если Стр.КоличествоКМ_в_Обороте<>Стр.КоличествоКМ_в_ОборотеПрограммно Тогда
				//Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(cis) Тогда
					//Стр.cis=Стр.cis;
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Добавить();
				//Добав.ID_Строки=Стр.ID_строки_партии;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=Стр.КоличествоКМ_в_Обороте-Стр.КоличествоКМ_в_ОборотеПрограммно;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Попытка
					Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(Стр.GTIN));
				Исключение
				КонецПопытки;
				Добав.СерийныйНомер=cis;
				
			КонецЕсли;
			
		КонецЦикла;
		  Конеццикла;
		
	КонецЕслИ;
	
КонецПроцедуры
